apache/nuttx/arch/arm/src/stm32f7/hardware/stm32f76xx77xx_pinmap.h
#define GPIO_DFSDM1_CKOUT_1   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN0)
#define GPIO_DFSDM1_CKOUT_2   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN2)
#define GPIO_DFSDM1_CKOUT_3   (GPIO_ALT|GPIO_AF3 |GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN3)
#define GPIO_DFSDM1_CKOUT_4   (GPIO_ALT|GPIO_AF3 |GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN10)
#define GPIO_DFSDM1_CKOUT_5   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN9)
#define GPIO_DFSDM1_CKIN0_1   (GPIO_ALT|GPIO_AF3 |GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN0)
#define GPIO_DFSDM1_CKIN0_2   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN3)
#define GPIO_DFSDM1_CKIN1_1   (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN2)
#define GPIO_DFSDM1_CKIN1_2   (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN13)
#define GPIO_DFSDM1_CKIN1_3   (GPIO_ALT|GPIO_AF3 |GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN2)
#define GPIO_DFSDM1_CKIN1_4   (GPIO_ALT|GPIO_AF4 |GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN7)
#define GPIO_DFSDM1_CKIN2_1   (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN15)
#define GPIO_DFSDM1_CKIN2_2   (GPIO_ALT|GPIO_AF3 |GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN4)
#define GPIO_DFSDM1_CKIN2_3   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN8)
#define GPIO_DFSDM1_CKIN3_1   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN6)
#define GPIO_DFSDM1_CKIN3_2   (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN1)
#define GPIO_DFSDM1_CKIN3_3   (GPIO_ALT|GPIO_AF3 |GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN8)
#define GPIO_DFSDM1_CKIN3_4   (GPIO_ALT|GPIO_AF10|GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN5)
#define GPIO_DFSDM1_CKIN4_1   (GPIO_ALT|GPIO_AF3 |GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN6)
#define GPIO_DFSDM1_CKIN4_2   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN11)
#define GPIO_DFSDM1_CKIN5_1   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN7)
#define GPIO_DFSDM1_CKIN5_2   (GPIO_ALT|GPIO_AF3 |GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN10)
#define GPIO_DFSDM1_CKIN5_3   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN13)
#define GPIO_DFSDM1_CKIN6_1   (GPIO_ALT|GPIO_AF3 |GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN0)
#define GPIO_DFSDM1_CKIN6_2   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTF|GPIO_PIN14)
#define GPIO_DFSDM1_CKIN7_1   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN8)
#define GPIO_DFSDM1_CKIN7_2   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN1)
#define GPIO_DFSDM1_CKIN7_3   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN11)
#define GPIO_DFSDM1_CKIN7_4   (GPIO_ALT|GPIO_AF6 |GPIO_PUSHPULL|GPIO_PORTS|GPIO_PIN1)
#define GPIO_DFSDM1_DATAIN0_1 (GPIO_ALT|GPIO_AF3 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN1)
#define GPIO_DFSDM1_DATAIN0_2 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN4)
#define GPIO_DFSDM1_DATAIN1_1 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN1)
#define GPIO_DFSDM1_DATAIN1_2 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN12)
#define GPIO_DFSDM1_DATAIN1_3 (GPIO_ALT|GPIO_AF3 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN3)
#define GPIO_DFSDM1_DATAIN1_4 (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN6)
#define GPIO_DFSDM1_DATAIN2_1 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN14)
#define GPIO_DFSDM1_DATAIN2_2 (GPIO_ALT|GPIO_AF3 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN5)
#define GPIO_DFSDM1_DATAIN2_3 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN7)
#define GPIO_DFSDM1_DATAIN3_1 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN7)
#define GPIO_DFSDM1_DATAIN3_2 (GPIO_ALT|GPIO_AF3 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN9)
#define GPIO_DFSDM1_DATAIN3_3 (GPIO_ALT|GPIO_AF10|GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN4)
#define GPIO_DFSDM1_DATAIN4_1 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN0)
#define GPIO_DFSDM1_DATAIN4_2 (GPIO_ALT|GPIO_AF3 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN7)
#define GPIO_DFSDM1_DATAIN4_3 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN10)
#define GPIO_DFSDM1_DATAIN5_1 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN6)
#define GPIO_DFSDM1_DATAIN5_2 (GPIO_ALT|GPIO_AF3 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN11)
#define GPIO_DFSDM1_DATAIN5_3 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN12)
#define GPIO_DFSDM1_DATAIN6_1 (GPIO_ALT|GPIO_AF3 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN1)
#define GPIO_DFSDM1_DATAIN6_2 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTF|GPIO_PIN13)
#define GPIO_DFSDM1_DATAIN7_1 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN9)
#define GPIO_DFSDM1_DATAIN7_2 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN10)
#define GPIO_DFSDM1_DATAIN7_3 (GPIO_ALT|GPIO_AF6 |GPIO_PULLUP|GPIO_PUSHPULL|GPIO_PORTD|GPIO_PIN0)

/* Ethernet MAC */

#define GPIO_ETH_MDC_0        (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN1)
#define GPIO_ETH_MDIO_0       (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN2)
#define GPIO_ETH_MII_COL_1    (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN3)
#define GPIO_ETH_MII_COL_2    (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTH|GPIO_PIN3)
#define GPIO_ETH_MII_CRS_1    (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN0)
#define GPIO_ETH_MII_CRS_2    (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTH|GPIO_PIN2)
#define GPIO_ETH_MII_RXD0_0   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN4)
#define GPIO_ETH_MII_RXD1_0   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN5)
#define GPIO_ETH_MII_RXD2_1   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN0)
#define GPIO_ETH_MII_RXD2_2   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTH|GPIO_PIN6)
#define GPIO_ETH_MII_RXD3_1   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN1)
#define GPIO_ETH_MII_RXD3_2   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTH|GPIO_PIN7)
#define GPIO_ETH_MII_RX_CLK_0 (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN1)
#define GPIO_ETH_MII_RX_DV_0  (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTA|GPIO_PIN7)
#define GPIO_ETH_MII_RX_ER_1  (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN10)
#define GPIO_ETH_MII_RX_ER_2  (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTI|GPIO_PIN10)
#define GPIO_ETH_MII_TXD0_1   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN12)
#define GPIO_ETH_MII_TXD0_2   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTG|GPIO_PIN13)
#define GPIO_ETH_MII_TXD1_1   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN13)
#define GPIO_ETH_MII_TXD1_2   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTG|GPIO_PIN14)
#define GPIO_ETH_MII_TXD2_0   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN2)
#define GPIO_ETH_MII_TXD3_1   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN8)
#define GPIO_ETH_MII_TXD3_2   (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTE|GPIO_PIN2)
#define GPIO_ETH_MII_TX_CLK_0 (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTC|GPIO_PIN3)
#define GPIO_ETH_MII_TX_EN_1  (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN11)
#define GPIO_ETH_MII_TX_EN_2  (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTG|GPIO_PIN11)
#define GPIO_ETH_PPS_OUT_1    (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTB|GPIO_PIN5)
#define GPIO_ETH_PPS_OUT_2    (GPIO_ALT|GPIO_AF11|GPIO_PUSHPULL|GPIO_PORTG|GPIO_PIN8)

